Tekla Open API Reference for Tekla Structures 2025
SecondaryTypeAttribute Constructor
Overload List
Name | Description
SecondaryTypeAttribute(Int32)
 The custom attribute [SecondaryType()] uses this to store the secondary type to the system. This is not to be used by itself.
SecondaryTypeAttribute(ConnectionBase.SecondaryType)
 The custom attribute [SecondaryType()] uses this to store the secondary type to the system. This is not to be used by itself.
Top
See Also
Reference
SecondaryTypeAttribute Class
Tekla.Structures.Plugins Namespace